app/controllers/groups_controller.rb

  def create
    @group = Group.new(params[:group])
    @group.user = current_user

    if @group.save!
---
INSERT INTO "groups" ("name", "description", "user_id", "created_at", "updated_at") VALUES('My Group', 'This is my group', 1, '2010-07-30 03:26:44', '2010-07-30 03:26:44')

  def show
    @group = Group.find(params[:id])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)